Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The article compared a Spring Boot application and a Quarkus application implementing the same functionality and even included a generator to create both applications. The generated applications are simple: a few entities, some REST services, and typical CRUD endpoints. What made it really interesting was that you could easily scale up the number of entities and services to see how both frameworks handled larger applications.
ja_jp: その記事では、同じ機能を実装するSpring BootアプリケーションとQuarkusアプリケーションを比較し、両方のアプリケーションを作成するためのジェネレーターも含まれていました。生成されるアプリケーションはシンプルで、いくつかのエンティティ、RESTサービス、典型的なCRUDエンドポイントを備えています。非常に興味深かったのは、エンティティとサービスの数を簡単にスケールアップして、両方のフレームワークがより大規模なアプリケーションをどのように処理するかを確認できたことです。

source: The artifact id of the created project. Not passing it triggers the interactive mode.
ja_jp: 作成されたプロジェクトのアーティファクトID。これを渡さないと、インタラクティブモードがトリガされます。

source: The artifact id of the target platform BOM.
ja_jp: ターゲットプラットフォームBOMのアーティファクトID

source: The assistant interfaces are defined in Quarkus "core", but their implementation are located in Quarkiverse (Chappie). You can, if needed, provide an alternative implementation of the assistant.
ja_jp: アシスタントのインターフェースは Quarkus の "core" で定義されていますが、その実装は Quarkiverse (Chappie) にあります。必要に応じて、アシスタントの代替実装を提供することも可能です。

source: The assistant runs **only** within dev mode and never affects your production application.
ja_jp: このアシスタントは開発モード内でのみ動作し、本番アプリケーションに影響を与えることはありません。

source: The associated configuration would be:
ja_jp: 関連する設定は次のようになります。

source: The associated environment variable is `QUARKUS_REDIS_PASSWORD`, or `QUARKUS_REDIS_<NAME>_PASSWORD` for named clients.
ja_jp: 関連する環境変数は `QUARKUS_REDIS_PASSWORD` で、名前付きクライアントの場合は `QUARKUS_REDIS_<NAME>_PASSWORD` となります。

source: The associated recorder should use the provided `MetricsFactory` to register metrics. For Agroal, this means using the `MetricFactory` API to observe `io.agroal.api.AgroalDataSourceMetrics` methods. For example:
ja_jp: 関連するレコーダーは、提供された `MetricsFactory` を使用してメトリクスを登録する必要があります。Agroal の場合、これは `MetricFactory` API を使用して `io.agroal.api.AgroalDataSourceMetrics` メソッドを監視することを意味します。以下はその例です。

source: The asynchronous message passing feature allows replying to messages which is not supported by Reactive Messaging. However, it is limited to single-event behavior (no stream) and to local messages.
ja_jp: 非同期メッセージパッシング機能は、Reactive Messagingではサポートされていないメッセージへの返信を可能にします。ただし、シングルイベント動作(ストリームなし)とローカルメッセージに限定されます。

source: The asynchronous version of that bean, for example `CompletionStage<QuarkusCqlSession>` or `CompletionStage<FruitDao>;
ja_jp: そのBeanの非同期バージョン、例えば `CompletionStage<QuarkusCqlSession>` や `CompletionStage<FruitDao>> など；

source: The attribute added to the histogram when the values were recorded.
ja_jp: 値の記録時にヒストグラムに追加された属性。

source: The attribute takes a list of triplets separated by commas: `<topic>:<partition>:<offset>`.
ja_jp: この属性は、コンマで区切られた 3 つの文字のリストを受け取ります: `<topic>:<partition>:<offset>`

source: The attributes are only added when authentication has already happened on a best-efforts basis. Whether the End User attributes are added as Span attributes depends on authentication and authorization configuration of your Quarkus application. If you create custom Spans prior to the authentication, Quarkus cannot add the End User attributes to them. Quarkus is only able to add the attributes to the Span that is current after the authentication has been finished. Another important consideration regarding custom Spans is active CDI request context that is used to propagate Quarkus `SecurityIdentity`. In principle, Quarkus is able to add the End User attributes when the CDI request context has been activated for you before the custom Spans are created.
ja_jp: 属性は、ベストエフォート方式で認証がすでに行われている場合にのみ追加されます。 End User 属性が Span 属性として追加されるかどうかは、Quarkus アプリケーションの認証および認可の設定によって異なります。 認証前にカスタム Span を作成した場合、Quarkus はそれらに End User 属性を追加できません。 Quarkus は、認証が完了した後にのみ、現在の Span に属性を追加できます。 カスタム Span に関するもう 1 つの重要な考慮事項は、Quarkus の `SecurityIdentity` を伝播するために使用されるアクティブな CDI リクエストコンテキストです。 原則として、カスタム Span が作成される前に CDI リクエストコンテキストがアクティブ化されている場合、Quarkus は End User 属性を追加できます。

source: The augmentation is a phase of an application build process during which the byte code of the application is optimized according to the application build time configuration. Initialization steps that used to happen when an EAR file was deployed on a Jakarta EE server such as parsing static configuration, creating proxy instances, etc. now happen at augmentation time. CDI beans added after augmentation won't work (because of the missing proxy classes) as well as build time properties (e.g. `quarkus.datasource.db-kind`) changed after augmentation will be ignored. Build time properties are marked with a lock icon (icon:lock[]) in the xref:all-config.adoc[list of all configuration options]. It doesn't matter if you use profiles or any other way to override the properties.
ja_jp: オーグメンテーションとは、アプリケーションのビルドプロセスの段階で、アプリケーションのバイトコードがアプリケーションのビルド時の設定に応じて最適化されることです。 EAR ファイルが Jakarta EE サーバーにデプロイされるときに行われていた初期化ステップ (静的設定のパース、プロキシーインスタンスの作成など) が、オーグメンテーション時に行われるようになりました。 オーグメンテーション後に追加されたCDI Beanは (プロキシークラスがないため) 動作しません。また、オーグメンテーション後に変更されたビルド時のプロパティー (例: `quarkus.datasource.db-kind`) は無視されます。 ビルド時のプロパティーには、xref:all-config.adoc[すべての設定オプションのリスト] でロックアイコン (icon:lock[]) が付いています。 プロファイルやその他の方法でプロパティーをオーバーライドしても関係ありません。

source: The augmentation is a phase of an application build process during which the byte code of the application is optimized according to the application build time configuration. Initialization steps that used to happen when an EAR file was deployed on a Jakarta EE server such as parsing static configuration, creating proxy instances, etc. now happen at augmentation time. CDI beans added after augmentation won't work (because of the missing proxy classes) as well as build time properties (e.g. `quarkus.datasource.db-kind`) changed after augmentation will be ignored. Build time properties are marked with a lock icon (icon:lock[]) in the xref:all-config.adoc[list of all configuration options]. It doesn't matter if you use profiles or any other way to override the properties. The build time properties that were active during augmentation are baked into the build.
ja_jp: オーグメンテーションとは、アプリケーションのビルドプロセスの段階で、アプリケーションのバイトコードがアプリケーションのビルド時の設定に応じて最適化されることです。EARファイルがJakarta EEサーバーにデプロイされるときに行われていた初期化ステップ（静的設定のパース、プロキシ・インスタンスの作成など）が、オーグメンテーション時に行われるようになりました。オーグメンテーション後に追加されたCDI Beanは（プロキシクラスがないため）動作しませんし、オーグメンテーション後に変更されたビルド時のプロパティ（例： `quarkus.datasource.db-kind` ）は無視されます。ビルド時のプロパティは、 link:all-config[すべての設定オプションのリスト]でロックアイコン (icon:lock[]) が付いています。プロファイルやその他の方法でプロパティを上書きしても関係ありません。オーグメンテーション時に有効だったビルド時のプロパティは、ビルドに焼き付けられます。

source: The authentication process completes as soon as the first `SecurityIdentity` is produced by one of the authentication mechanisms.
ja_jp: 認証メカニズムの 1 つによって最初の `SecurityIdentity` が生成されるとすぐに、認証プロセスが完了します。

source: The authorization code flow is complete, and the Quarkus web-app uses the tokens issued to access user information and to grant the relevant role-based authorization. The following tokens are issued:
ja_jp: 認可コードフローが完了すると、Quarkus Web アプリは発行されたトークンを使用してユーザー情報にアクセスし、関連するロールベースの認可を付与します。 以下のトークンが発行されます。

source: The authorization code flow is completed and the Quarkus web-app uses the tokens issued to access information about the user and grant the relevant role-based authorization to that user. The following tokens are issued:
ja_jp: 認可コードフローが完了し、Quarkus web-appは発行されたトークンを使用して、ユーザーに関する情報にアクセスし、そのユーザーに関連するロールベースの認可を付与します。発行されるトークンは以下の通りです。

source: The authorization code flow is completed and the Quarkus web-app uses the tokens issued to access information about the user and grants the relevant role-based authorization to that user. The following tokens are issued:
ja_jp: 認可コードフローが完了し、Quarkus Webアプリは発行されたトークンを使用してユーザーに関する情報にアクセスし、そのユーザーに関連するロールベースの認可を付与します。発行されるトークンは以下の通りです:

source: The authorization code flow is enabled with the `quarkus.oidc.application-type=web-app` application type.
ja_jp: 認可コードフローは、アプリケーションタイプ `quarkus.oidc.application-type=web-app` で有効になります。

source: The auto-scaler class. Possible values: `kpa` for Knative Pod Autoscaler, `hpa` for Horizontal Pod Autoscaler
ja_jp: オートスケーラークラス。可能な値： `kpa` （Knative Pod Autoscaler）、 `hpa` （Horizontal Pod Autoscaler）

source: The autoscaling metric to use. Possible values (concurency, rps, cpu)
ja_jp: 使用するオートスケーリングメトリック。使用可能な値 (concurency、rps、cpu)

source: The available RESTEasy Reactive extensions are:
ja_jp: 利用可能な RESTEasy Reactive エクステンションは以下の通りです:

source: The available options are `TLSv1`, `TLSv1.1`, `TLSv1.2`, and `TLSv1.3`.
ja_jp: 使用可能なオプションは、`TLSv1`、`TLSv1.1`、`TLSv1.2`、`TLSv1.3` です。

source: The back-channel notification contains a logout token. It must be cached so that when one of the authenticated users tries to access Quarkus, this user's ID token can be matched against this logout token. The subject (`sub`) claim value is used by default to match the ID and logout tokens, but the session id (`sid`) claim can be used instead.
ja_jp: バックチャネル通知にはログアウトトークンが含まれています。認証済みユーザーのいずれかが Quarkus にアクセスしようとしたときに、そのユーザーの ID トークンをこのログアウトトークンと照合できるように、これをキャッシュしておく必要があります。デフォルトでは、サブジェクト (`sub`) クレーム値を使用して ID トークンとログアウトトークンの照合を行いますが、代わりにセッション ID (`sid`) クレームを使用することも可能です。

source: The back-pressure is handled by AMQP _credits_. The outbound connector only requests the amount of allowed credits. When the amount of credits reaches 0, it waits (in a non-blocking fashion) until the broker grants more credits to the AMQP sender.
ja_jp: バックプレッシャーは AMQP _credits_ によって処理されます。アウトバウンドコネクターは、許可されたクレジットの量のみを要求します。クレジットの量が 0 に達すると、ブローカーが AMQP 送信者にさらにクレジットを付与するまで (非ブロッキング方式で) 待機します。

source: The backend uses the _<default>_ Infinispan client (unless configured differently), so ensure its configuration is set up accordingly (or use the xref:infinispan-dev-services.adoc[Infinispan Dev Service])
ja_jp: バックエンドは (別の設定がされていない限り) _<default>_ Infinispan クライアントを使用するため、適切に セットアップされていることを確認してください (または、xref:infinispan-dev-services.adoc[Infinispan Dev Service] を使用してください)。

source: The backend uses the _<default>_ Redis client (if not configured otherwise), so make sure it's configured (or use the xref:redis-dev-services.adoc[Redis Dev Service])
ja_jp: バックエンドは _<default>_ Redisクライアントを使うので(他に設定されていない場合)、設定されているようにしてください(または xref:redis-dev-services.adoc[Redis Dev Service] を使ってください)

source: The backend uses the _<default>_ Redis client (if not configured otherwise), so make sure it's configured (or use the xref:redis-dev-services.adoc[redis dev service])
ja_jp: バックエンドは _<default>_ Redisクライアントを使用します（他に設定されていない場合）。そのため、設定されていることを確認してください (あるいは xref:redis-dev-services.adoc[redis dev service] を使用してください)

source: The base *language* file contains translations common to all dialects. A *country-specific* file contains only the keys that differ from the base.
ja_jp: ベースの *言語* ファイルには、すべての Dialect に共通の翻訳が含まれます。*国固有* のファイルには、ベースと異なるキーのみが含まれます。

source: The base URI must be always set.
ja_jp: ベース URI は常に設定する必要があります。

source: The basic connector is closer to a low-level API and is reserved for advanced users. However, unlike others low-level WebSocket clients, it is still a CDI bean and can be injected in other beans. It also provides a way to configure the execution model of the callbacks, ensuring optimal integration with the rest of Quarkus.
ja_jp: 基本コネクターは低レベル API に近いため、上級ユーザー向けに予約されています。 ただし、他の低レベルの WebSocket クライアントとは異なり、これは引き続き CDI Bean であり、他の Bean に注入できます。 また、コールバックの実行モデルを設定する方法も提供し、Quarkus の他の部分との最適なインテグレーションを確保します。

source: The basic idea is that every message is potentially a very simple template. In order to prevent type errors a message is defined as an annotated method of a *message bundle interface*. Quarkus generates the *message bundle implementation* at build time. Subsequently, the bundles can be used at runtime:
ja_jp: 基本的な考え方は、すべてのメッセージは潜在的に非常にシンプルなテンプレートであるということです。型エラーを防ぐために、メッセージは *メッセージバンドルインターフェース* のアノテーションメソッドとして定義されます。Quarkusは、ビルド時に *メッセージバンドルの実装を* 生成します。そのため、実行時にバンドルを使用することができます。

source: The basic idea is that every message is potentially a very simple template. In order to prevent type errors, a message is defined as an annotated method of a *message bundle interface*. Quarkus generates the *message bundle implementation* at build time.
ja_jp: 基本的な考え方として、すべてのメッセージを非常に単純なテンプレートである可能性があるとみなします。 タイプエラーを防ぐために、メッセージは *メッセージバンドルインターフェイス* のアノテーション付きメソッドとして定義されます。 Quarkus はビルド時に *メッセージバンドル実装* を生成します。

source: The basic layout has the following parts:
ja_jp: 基本的なレイアウトは以下の部分で構成されています:

source: The basics
ja_jp: 基本情報

source: The bcrypt hash includes the salt, so no separate salt storage is needed.
ja_jp: bcrypt ハッシュにはソルトが含まれているため、個別のソルトストレージは不要です。

source: The bean archive is synthesized from:
ja_jp: Bean のアーカイブは、次のものから合成されます。

source: The bean can customize a specific client using the `@MongoClientName` qualifier to indicate the client name. When there is no qualifier, it customizes the default client. At most one customizer can be used per client. If multiple customizers targeting the same client are detected, an exception is thrown at build time.
ja_jp: Bean は、クライアント名を示す `@MongoClientName` 修飾子を使用して特定のクライアントをカスタマイズできます。 修飾子がない場合、Bean はデフォルトのクライアントをカスタマイズします。 クライアントごとに最大 1 つのカスタマイザーを使用できます。 同じクライアントを対象とする複数のカスタマイザーが検出されると、ビルド時に例外が出力されます。

source: The bean constructor is called when the application starts and the resulting contextual instance is stored in the application context.
ja_jp: Beanのコンストラクターは、アプリケーションの起動時に呼び出され、結果として得られるコンテキストインスタンスがアプリケーションのコンテキストに格納されます。

source: The bean implements `Runnable`, a format we can directly pass to the executor service as a parameter.
ja_jp: このBeanは `Runnable` を実装しています。これは、エグゼキュータ・サービスにパラメータとして直接渡せるフォーマットです。

source: The bean instance is associated with the current _request_ (usually an HTTP request).
ja_jp: Beanインスタンスは、現在の _リクエスト_ (通常はHTTPリクエスト)に関連付けられています。

source: The bean instance is created with a function returned from a recorder method.
ja_jp: Bean インスタンスは、レコーダーメソッドから返される関数を使用して作成されます。

source: The bean instance is initialized during `RUNTIME_INIT`.
ja_jp: Bean インスタンスは、 `RUNTIME_INIT` の間に初期化されます。

source: The bean instance is supplied by a value returned from a recorder method.
ja_jp: Bean インスタンスは、レコーダーメソッドから返される値によって提供されます。

source: The bean is created and the `init()` method is invoked upon the contextual instance when the application starts.
ja_jp: アプリケーションが起動すると、Bean が作成され、コンテキストインスタンスに対して `init()` メソッドが呼び出されます。

source: The bean is created and the `initReactive()` method is invoked upon the contextual instance when the application starts, on a non-blocking thread, which requires the Quarkus Vert.x extension (there will be an error if it is not present).
ja_jp: アプリケーションが起動すると、Bean が作成され、Quarkus Vert.x エクステンションを必要とする非ブロッキングスレッドで、コンテキストインスタンスに対して `initReactive()` メソッドが呼び出されます（存在しない場合はエラーになります）。

source: The bean is made `@RequestScoped` as the tenant resolution depends on the incoming request.
ja_jp: Beanは、テナントの解決が入ってくるリクエストに依存するため `@RequestScoped` にします。

source: The bean of that class can be injected to access the telemetry data. This is an example to obtain the spans:
ja_jp: そのクラスの Bean は、テレメトリーデータにアクセスするために注入できます。これはスパンを取得する例です。

source: The bearer token is issued by a Keycloak Server and represents the subject to which the token was issued for. For being an OAuth 2.0 Authorization Server, the token also references the client acting on behalf of the user.
ja_jp: ベアラートークンは、Keycloakサーバーによって発行され、トークンが発行された対象を表します。OAuth 2.0 認可サーバーであるため、トークンはユーザーの代わりに動作するクライアントも参照します。

source: The bearer tokens are issued by OIDC and OAuth 2.0 compliant authorization servers, such as link:https://www.keycloak.org[Keycloak].
ja_jp: ベアラートークンは、 link:https://www.keycloak.org[Keycloak] などのOIDCやOAuth2.0に準拠した認可サーバーで発行されます。

source: The bearer tokens issued by the Keycloak server serve as:
ja_jp: Keycloak サーバーによって発行されるベアラートークンは、以下の役割を果たします。

source: The beauty of generated finder and query methods is that they are type-checked at build time: they will be validated and guarantee that you did not make any typo in the entity names, their fields, the HQL/SQL syntax, or the name of their parameters.
ja_jp: 生成されたファインダーメソッドとクエリメソッドの利点は、ビルド時 に型チェックされることです。これにより、エンティティ名、そのフィールド、HQL/SQL 構文、またはパラメーター名に誤植がないことが検証され、保証されます。

source: The behavior is as follows:
ja_jp: 動作は次のとおりです。

source: The behavior is similar to a declaration of a `ShutdownDelayInitiatedEvent` observer. The following examples are functionally equivalent.
ja_jp: この動作は、`ShutdownDelayInitiatedEvent` オブザーバーの宣言に似ています。以下の例は機能的に同等です。

source: The behavior of `quarkus ext ls` will vary depending on context.
ja_jp: `quarkus ext ls` の動作はコンテキストによって異なります。

source: The below code snippet shows how we can create dynamic clients using the configurations in <<multiple-clients-configuration>>.
ja_jp: 以下のコードスニペットは、 <<multiple-clients-configuration>> の設定を使用して動的クライアントを作成する方法を示しています。

source: The benefit of this approach, is that it can be combined with OpenShift's `DeploymentConfig` that makes it easy to roll out changes to the cluster.
ja_jp: このアプローチの利点は、クラスターへの変更を簡単にロールアウトできる OpenShift の `DeploymentConfig` と組み合わせることができることです。

source: The benefits of up-to-date checks and the interaction of the build cache come with the cost of modeling the _inputs_ and _outputs_. Inputs are not only files or directories, but also the Java version used during the build, the operating system, the working directory, configuration options, and so on. So everything that influences the output of a task action must be declared as an input of the task.
ja_jp: up-to-date チェックとビルドキャッシュの相互作用の利点には、_入力_ と _出力_ のモデリングコストが伴います。 入力には、ファイルやディレクトリーだけでなく、ビルド時に使用された Java のバージョン、オペレーティングシステム、ワーキングディレクトリー、設定オプションなども含まれます。つまり、タスク操作の出力に影響を与えるすべてが、タスクの入力として宣言される必要があります。

source: The best option is then to annotate a method of your business service with your constraints (or in our particular case with `@Valid`):
ja_jp: 最良の選択肢は、ビジネスサービスのメソッドに制約をアノテーションすることです(私たちの場合は `@Valid` ):

source: The best way to add OpenTracing capability to reactive messaging based applications is by adding the `Traced` annotation to all incoming methods.
ja_jp: OpenTracingの機能をリアクティブなメッセージングベースのアプリケーションに追加する最良の方法は、すべての受信メソッドに `Traced` アノテーションを追加することです。

source: The best way to enable CDI bean discovery for a module in a multi-module project would be to include a `META-INF/beans.xml` file, unless it is the main application module already configured with the `io.quarkus` Gradle plugin, in which case it will be indexed automatically.
ja_jp: マルチモジュールプロジェクトでモジュールの CDI Bean 検出を有効にする最善の方法は、`META-INF/beans.xml` ファイルを含めることです。ただし、`io.quarkus` Gradle プラグインですでに設定されているメインのアプリケーションモジュールである場合は、自動的にインデックス化されます。

source: The best way to enable CDI bean discovery for a module in a multi-module project would be to include a `META-INF/beans.xml` file, unless it is the main application module already configured with the quarkus-maven-plugin, in which case it will be indexed automatically.
ja_jp: マルチモジュールプロジェクトのモジュールでCDI Bean検出を有効にするベストの方法は、 モジュールが、メインアプリケーションモジュールで、すでにquarkus-maven-pluginで設定されていない限り、 `META-INF/beans.xml` ファイルをインクルードすることです。モジュールが、メインアプリケーションモジュールで、すでにquarkus-maven-pluginで設定されている場合は、自動的にインデックスが作成されます。

source: The best way to enable CDI bean discovery for a module in a multi-module project would be to include a `META-INF/beans.xml` file, unless it is the main application module already configured with the quarkus-maven-plugin, in which case it will indexed automatically.
ja_jp: マルチモジュールプロジェクトのモジュールでCDI Bean検出を有効にするベストの方法は、 モジュールが、メインアプリケーションモジュールで、すでにquarkus-maven-pluginで設定されていない限り、 `META-INF/beans.xml` ファイルをインクルードすることです。モジュールが、メインアプリケーションモジュールで、すでにquarkus-maven-pluginで設定されている場合は、自動的にインデックスが作成されます。

source: The best way to enable CDI bean discovery for a module in a multi-module project would be to include the `jandex-maven-plugin`, unless it is the main application module already configured with the quarkus-maven-plugin, in which case it will be indexed automatically.
ja_jp: マルチモジュールプロジェクトのモジュールで CDI Bean 検出を有効にする最善の方法は、それが `quarkus-maven-plugin` で既に設定されているメインアプリケーションモジュールでない限り、jandex-maven-plugin を含めることです。自動的にインデックスされます。

source: The best way to enable CDI bean discovery for a module in a multi-module project would be to include the `jandex-maven-plugin`, unless it is the main application module already configured with the quarkus-maven-plugin, in which case it will indexed automatically.
ja_jp: マルチモジュールプロジェクト内のモジュールでCDI Bean検出を有効にするベストの方法は、 モジュールがメインアプリケーションモジュールでquarkus-maven-pluginが既に構成されていない限り、 `jandex-maven-plugin` をインクルードすることです。モジュールがメインアプリケーションモジュールでquarkus-maven-pluginが既に構成されている場合は自動的にインデックスが作成されます。

source: The big bang replacement, when you have manual instrumentation
ja_jp: 手動計装がある場合のビッグバン方式の置換

source: The biggest advantage we take when deploying our app as a container is to deploy a container with the natively compiled application. Why? Because Heroku will stop or sleep the application when there's no incoming traffic. A native application will wake up much faster from its sleep.
ja_jp: アプリケーションをコンテナーとしてデプロイする際の最大のメリットは、ネイティブにコンパイルされたアプリケーションを使ってコンテナーをデプロイすることです。その理由は、Heroku は着信トラフィックがないときにアプリケーションを停止またはスリープさせるからです。ネイティブアプリケーションは、スリープ状態からより早く目覚めます。

source: The biggest change is that the old datasource (JDBC and reactive) configuration that was deprecated in 1.3 is now gone. So if your datasources don't work anymore, that's probably because you haven't migrated to the new configuration yet.
ja_jp: 最大の変更点は、1.3 で非推奨となった古いデータソース (JDBC とリアクティブ) の設定がなくなったことです。ですから、もしあなたのデータソースが動作しなくなった場合、それはおそらくあなたがまだ新しい設定に移行していないことが原因です。

source: The bindings source class must also use `T` as the name of the type variable:
ja_jp: バインディングソースクラスも、型変数の名前として `T` を使用する必要があります。

source: The blocking data source (`io.quarkus.redis.datasource.RedisDataSource`) is implemented on top of the reactive one (`io.quarkus.redis.datasource.ReactiveRedisDataSource`). The `ReactiveRedisDataSource` is implemented on top of the `io.vertx.mutiny.redis.Redis` API.
ja_jp: ブロッキングデータソース (`io.quarkus.redis.datasource.RedisDataSource`) はリアクティブデータソース (`io.quarkus.redis.datasource.ReactiveRedisDataSource`) の上に実装されています。 `ReactiveRedisDataSource` は `io.vertx.mutiny.redis.Redis` API の上に実装されています。

source: The blue and red services are registered in https://www.consul.io/[Consul].
ja_jp: ブルーとレッドのサービスは link:https://www.consul.io/[Consul]に登録されています。

source: The body of an HTTP response is not compressed by default. You can enable the HTTP compression support by means of `quarkus.http.enable-compression=true`.
ja_jp: HTTP レスポンスのボディは、デフォルトでは圧縮されていません。 `quarkus.http.enable-compression=true` を使用して HTTP 圧縮サポートを有効にできます。

source: The bridge is more than the simple OTLP registry found in Quarkiverse. In this extension, the OpenTelemetry SDK provides a Micrometer registry implementation based on the https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/micrometer/micrometer-1.5/library[`micrometer/micrometer-1.5`] OpenTelemetry instrumentation library.
ja_jp: このブリッジは、Quarkiverse にある単純な OTLP レジストリー以上のものです。このエクステンションでは、OpenTelemetry SDK は、https://github.com/open-telemetry/opentelemetry-java-instrumentation/tree/main/instrumentation/micrometer/micrometer-1.5/library[`micrometer/micrometer-1.5`] OpenTelemetry 計装ライブラリーに基づく Micrometer レジストリー実装を提供します。

source: The broader Java ecosystem is moving to Jakarta dependencies, allowing for easier sharing and compatible implementations.
ja_jp: より広範なJavaエコシステムはJakarta依存に移行しており、より容易な共有と互換性のある実装を可能にしています。

source: The broker hostname Type: _string_
ja_jp: ブローカーのホスト名 Type: _string_

source: The broker port Type: _int_
ja_jp: ブローカーポート Type: _int_

source: The broker we have created is called `default`, this broker will receive the cloud events. The broker is also referenced in the function YAML files.
ja_jp: 作成したブローカーは `default` といい、このブローカーはクラウドのイベントを受け取ります。このブローカは関数のYAMLファイルでも参照されています。
